Repository: zipf/perldoc-es
Catalog: tm/work/perlspanish-omegat.explorer.tmx
Source language: en_us
Languages: es_es

source: If you really mean for such values to terminate the loop, they should be tested for explicitly:
es_es: Si realmente quiere mirar por esos valores para terminar el bucle, deben hacerse la prueba de forma explícita:

source: This release is known not to build on Windows 95.
es_es: Esta publicación se sabe que no se compila en Windows 95.

source: perldata Perl data structures
es_es: perldata Estructuras de datos

source: You can browse and search the Perl 5 bugs at http://bugs.perl.org/
es_es: Puede navegar y buscar en el web de los errores de Perl 5 en http://bugs.perl.org/

source: So this expression:
es_es: Así que esta expresión:

source: printf "<%6s>", "a"; # prints "< a>"
es_es: printf "<%6s>", "a"; # imprime "< a>"

source: Some syntax errors involving unrecognized filetest operators are now handled correctly by the parser.
es_es: Algunos errores de sintaxis involucrados en no reconocer operadores de test de archivo son ahora manejados correctamente por el analizador.

source: open(OUTPUT, '|sort >foo') # pipe to sort
es_es: open(OUTPUT, '|sort >foo') # tubería a sort

source: Builtin types include:
es_es: Tipos integrados incluyen:

source: =head2 Changed "A thread exited while %d threads were running"
es_es: =head2 Caambiada "I<A thread exited while %d threads were running>" (Un hilo de ejecución terminó mientras %d hilos se estaban ejecutando)

source: Or if you try to do
es_es: O si trata de hacer

source: perlop Perl operators and precedence
es_es: perlop Operadores y precedencia

source: # run-time warnings enabled after here
es_es: # advertencias en ejecución activas desde aquí

source: Otherwise, C<require> demands that a library file be included if it hasn't already been included.
es_es: De lo contrario, C<require> demanda que un archivo de biblioteca sea incluido si no se hubiera incluido ya.

source: %hash = map ( lc($_), 1 ), @array # evaluates to (1, @array)
es_es: %hash = map ( lc($_), 1 ), @array # evalúa a (1, @array)

source: In other boolean contexts, C<< <filehandle> >> without an explicit C<defined> test or comparison elicits a warning if the C<use warnings> pragma or the B<-w> command-line switch (the C<$^W> variable) is in effect.
es_es: En otros contextos booleanos, C<< <identificador-de-archivo> >> sin un explícito C<defined> o comparación, provoca una advertencia si el pragma C<use warnings> o la opción B<-w> en la línea de comandos (la variable C<$^W>) está en vigor.

source: The C<//> matching operator is documented in L<perlop>.
es_es: El operador de detección de coincidencias C<//> se describe en L<perlop>.

source: Thus, C<"$foo\Qbaz$bar"> is converted to C<$foo . (quotemeta("baz" . $bar))> internally.
es_es: Así, C<"$foo\Qbaz$bar"> es convertida internamente a C<$foo . (quotemeta("baz" . $bar))>.

source: $sentence =~ s{\Q$substring\E}{big bad wolf};
es_es: $instruccion =~ s{\Q$subcadena\E}{gran lobo malo};

source: =item rewinddir DIRHANDLE X<rewinddir>
es_es: =item rewinddir IDENTIFICADOR_DIR X<rewinddir>

source: These have been fixed by Dave Mitchell and Yves Orton.
es_es: Esto ha sido solventado por Dave Mitchell e Yves Orton.

source: Here's one that avoids the problem you get into if you explicitly test for end-of-file on an interactive file descriptor causing your program to appear to hang.
es_es: Aquí hay una que evita el problema, al comprobar explícitamente, por el fin de archivo en un descriptor de archivo interactivo, que parezca que su programa se haya quedado colgado.

source: Using the constructor from the C<IO::Handle> package (or one of its subclasses, such as C<IO::File> or C<IO::Socket>), you can generate anonymous filehandles that have the scope of the variables used to hold them, then automatically (but silently) close once their reference counts become zero, typically at scope exit:
es_es: Utilizando el constructor del paquete C<IO::Handle> (o una de sus subclases, como C<IO::File> o C<IO::Socket>), puede generar identificadores de archivo anónimos que tienen el ámbito de cualquiera de las variables que contengan referencias a ellos, y entonces, automáticamente (pero silenciosamente), son cerrados cuando el contador de referencias llegue a cero, normalmente a la salida del ámbito actual:

source: # the `#' on the previous line must be the first char on line
es_es: # el `#' en la línea anterior debe ser el primer carácter de la línea

source: If multiple distinct capture groups have the same name then the $+{NAME} will refer to the leftmost defined group in the match.
es_es: Si múltiples grupos de captura tienen el mismo nombre, entonces $+{NOMBRE} se referirá al grupo definido más a la izquierda, dentro de la coincidencia.

source: Within each repetition of a group, positioning with C<@> starts over at 0.
es_es: Dentro de cada repetición de un grupo, posicionarse con C<@> comienza de nuevo en 0.

source: =head2 Variable names X<variable, name> X<variable name> X<data type> X<type>
es_es: =head2 Nombres de variable X<variable, name> X<variable name> X<data type> X<type> X<variable, nombre> X<nombre variable> X<tipo dato> X<tipo>

source: For others, it serves as a convenient, high-level replacement for most of what they'd program in low-level languages like C or C++.
es_es: Para otros, es un cómodo sustituto de alto nivel para la mayor parte de los programas que desarrollarían en lenguajes de bajo nivel como C o C++.

source: opens a filehandle to an anonymous temporary file.
es_es: abre un identificador de archivo a un archivo anónimo temporal.

source: Some internal code cleanup
es_es: Alguna limpieza interna de código

source: The hex() and oct() functions make these conversions for you.
es_es: Las funciones hex() y oct() hacen estas conversiones por usted.

source: If EXPR is a bareword, the require assumes a "F<.pm>" extension and replaces "F<::>" with "F</>" in the filename for you, to make it easy to load standard modules.
es_es: Si EXPR es una simple palabra, el require asume una extensión "F<.pm>" y le reemplaza "F<::>" con "F</>" en el nombre del archivo, para que sea fácil cargar módulos estándar.

source: The digest of the password is stored, not the password itself.
es_es: El I<digest> de una contraseña se almacena, no la propia contraseña.

source: For instance, the typical "match a double-quoted string" problem can be most efficiently performed when written as:
es_es: Por ejemplo, el problema típico de "coincidir con una cadena doblemente entrecomillada" puede ser más eficientemente realizada cuando se escribe como:

source: # ... # code for each line
es_es: # ... # código por cada línea

source: perlcn Perl for Simplified Chinese (in EUC-CN)
es_es: perlcn Perl para chino simplificado (en EUC-CN)

source: C<Unicode::UCD> upgraded to version 0.24
es_es: C<Unicode::UCD> actualizado a la versión 0.24

source: C<threads> upgraded to version 1.07
es_es: C<threads> actualizado a la versión 1.07

source: A little forethought may save you a vast amount of effort later on.
es_es: Un poco de previsión puede ahorrar una gran cantidad de esfuerzo más adelante.

source: On most systems, you are not allowed to change the ownership of the file unless you're the superuser, although you should be able to change the group to any of your secondary groups.
es_es: En la mayoría de los sistemas, no se le permite cambiar la propiedad del archivo a menos que sea el superusuario, aunque sí pueda cambiar el grupo a cualquiera de sus grupos secundarios.

source: which uses C<< (?>...) >> matches exactly when the one above does (verifying this yourself would be a productive exercise), but finishes in a fourth the time when used on a similar string with 1000000 C<a>s.
es_es: que hace que C<< (?>...) >> coincida exactamente con la cadena anterior (verificar esto por uno mismo puede ser un ejercicio muy productivo), pero termina en la cuarta parte de tiempo cuando se usa en una cadena similar con 1.000.000 de C<a>.

source: By default the format for a file is the one having the same name as the filehandle, but the format for the current output channel (see the C<select> function) may be set explicitly by assigning the name of the format to the C<$~> variable.
es_es: Por defecto el formato de un archivo es el que tiene el mismo nombre que el identificador de archivo, pero el formato para el canal de salida (vea la función C<select>) se puede establecer de forma explícita mediante la asignación del nombre del formato a la variable C<$~>.

source: =item m?PATTERN?msixpodualgc X<?> X<operator, match-once>
es_es: =item m?PATRÓN?msixpodualgc X<?> X<operator, match-once> X<operador, coincide una vez>

source: =item getppid X<getppid> X<parent> X<pid>
es_es: =item getppid X<getppid> X<parent> X<pid> X<padre>

source: Evaluation of EXPR may be in list, scalar, or void context, depending on how the return value will be used, and the context may vary from one execution to the next (see C<wantarray>).
es_es: Evaluación de EXPR puede estar en contextos lista, escalar, o contexto vacío, dependiendo de cómo el valor de retorno será utilizado, y el contexto puede variar de una ejecución a la siguiente (ver C<wantarray>).

source: Note the I<characters>: depending on the status of the filehandle, either (8-bit) bytes or characters are read.
es_es: Note los I<caracteres>: dependiendo del estado del identificador de archivo, son leídos bytes (8-bit) o caracteres.

source: Thus the limits for Perl numbers stored as native integers would typically be -2**31..2**32-1, with appropriate modifications in the case of 64-bit integers.
es_es: Así, los límites para números Perl almacenados como enteros nativos serán normalmente -2**31..2**32-1, con las modificaciones correspondientes en el caso de los enteros de 64 bits.

source: These differences can be either positive (e.g. extensions for the features of the particular platform that are not supported in the source release of perl) or negative (e.g. might be based upon a less current source release of perl).
es_es: Estas diferencias pueden ser positivas (p. ej., extensiones para las características de una plataforma específica que no se ofrecen en la distribución de código fuente de perl) o negativas (p. ej., la distribución binaria puede estar basada en una distribución de código fuente de perl menos reciente).

source: In scalar context, returns the last element removed, or C<undef> if no elements are removed.
es_es: En contexto escalar, devuelve el último elemento eliminado, o C<undef> si no hay elementos eliminados.

source: # Delete (most) C comments.
es_es: # Eliminar (la mayoría) comentarios C.

source: Whatever you choose, be consistent!
es_es: Lo que elija, ¡debe ser coherente!

source: Other assignment operators work similarly.
es_es: Otros operadores de asignación funcionan de manera similar.

source: You are permitted and encouraged to use this code and any derivatives thereof in your own programs for fun or for profit as you see fit.
es_es: Le permitimos y animamos a utilizar este código y los derivados que surjan en sus propios programas, ya sea con fines de diversión o beneficio.

source: Perl limits barewords (like identifiers) to about 250 characters.
es_es: Perl limita las palabras sueltas (como a los identificadores) a cerca de 250 caracteres.

source: If C<readline> encounters an operating system error, C<$!> will be set with the corresponding error message.
es_es: Si C<readline> encuentra un error del sistema operativo, C<$!> será puesto al correspondiente mensaje de error.

source: # The operators -f, -d, -l, -b, -c, -p, and -S.
es_es: # Los operadores -f, -d, -l, -b, -c, -p, y -S.

source: The new behaviour in the absence of a SCALAR method is to return TRUE if in the middle of an C<each> iteration, and otherwise call FIRSTKEY to check if the hash is empty (making sure that a subsequent C<each> will also begin by calling FIRSTKEY).
es_es: El nuevo comportamiento en ausencia de un método SCALAR es retornar verdadero si está en medio de una iteración C<each>, y de otra manera, llamar a FIRSTKEY para comprobar si el hash está vacío (asegurarse de que una posterior C<each> también comenzará llamando FIRSTKEY).

source: A subroutine that is not defined may still be callable: its package may have an C<AUTOLOAD> method that makes it spring into existence the first time that it is called; see L<perlsub>.
es_es: Una subrutina que no ha sido definida puede ser ejecutada: su paquete puede tener un método C<AUTOLOAD> que la hace aparecer la primera vez que es llamada; ver L<perlsub>.

source: Perl can process line directives, much like the C preprocessor.
es_es: Perl puede procesar directivas como lo hace el preprocesador de C.

source: =item Time-related functions X<time> X<date>
es_es: =item Funciones relacionadas con el tiempo X<time> X<date>

source: If all else fails, consult http://perldoc.perl.org/ which has the complete documentation in HTML and PDF format.
es_es: Como último recurso, puede consultar http://perldoc.perl.org/, que incluye toda la documentación en formato HTML y PDF.

source: Calls the System V IPC function msgsnd to send the message MSG to the message queue ID.
es_es: Llama a la función msgsnd de System V IPC para enviar el mensaje MSG a la cola de mensajes ID.

source: If the substring is beyond either end of the string, substr() returns the undefined value and produces a warning.
es_es: Si la subcadena está más allá de cada extremo de la cadena, substr() devuelve el valor indefinido y produce una advertencia.

source: perlaix Perl notes for AIX
es_es: perlaix Notas para AIX

source: That is, if the left operand is true, the right operand is not even evaluated.
es_es: Es decir, si el operando izquierdo es verdadero, el operando de la derecha no es ni siquiera evaluado.

source: a comparison such as C<$_ E<lt> 10> or C<$x eq "abc"> (or of course C<$_ ~~ $c>)
es_es: una comparación, como C<$_ E<lt> 10> o C<$x eq "abc"> (o, naturalmente, C<$_ ~~ $c>)

source: Matches as C<S{max}|S{max-1}|...|S{min+1}|S{min}>.
es_es: Coincide con C<S{max}|S{max-1}|...|S{min+1}|S{min}>.

source: /etc/games is no good at canasta line 123.
es_es: /etc/games no está bien at canasta line 123.

source: Here's an example of setting a filehandle named C<REMOTE> to be non-blocking at the system level.
es_es: Aquí hay un ejemplo de poner un identificador de archivo llamado C<REMOTE> a no bloqueante a nivel de sistema.

source: void $scalar whole: @array %hash
es_es: nulo $escalar completo: @array %hash

source: FILEHANDLE may be an expression whose value gives the name of the actual filehandle.
es_es: IDENTIFICADOR_ARCHIVO puede ser una expresión cuyo valor da el nombre del identificador de archivo real.

source: An example is checking if a correct password is given.
es_es: Un ejemplo es comprobando si se ha dado una contraseña correcta.

source: When you get tired of writing a custom print for your data structures, you might look at the standard L<Dumpvalue> or L<Data::Dumper> modules.
es_es: Cuando se canse de escribir una impresión personalizada de las estructuras de datos, podría mirar los módulos estándar L<Dumpvalue> o L<Data::Dumper>.

source: There is no way for pack() and unpack() to know where characters are going to or coming from, so they handle their output and input as flat sequences of characters.
es_es: No hay forma, para un pack() y unpack(), saber qué caracteres van o vienen, por lo que controlan su salida y entrada como secuencias planas de caracteres.

source: Note that the emulation built with lockf(3) doesn't provide shared locks, and it requires that FILEHANDLE be open with write intent.
es_es: Note que la emulación integrada con lockf(3) no provee de bloqueos compartidos y requiere que el IDENTIFICADOR_ARCHIVO sea abierto con intención de escribir en el.

source: m Treat string as multiple lines.
es_es: m Trata la cadena como un conjunto de múltiples líneas.

source: contains all the elements of @foo followed by all the elements of @bar, followed by all the elements returned by the subroutine named SomeSub called in list context, followed by the key/value pairs of %glarch.
es_es: contiene todos los elementos de @foo seguido por todos los elementos de @bar, seguido de todos los elementos devueltos por la subrutina llamada AlgunaSub llamada en contexto lista, seguido de los pares clave/valor de %glarch.

source: For the I<gethost*()> functions, if the C<h_errno> variable is supported in C, it will be returned to you via C<$?> if the function call fails.
es_es: Para las funciones I<gethost*()>, si la variable C<h_errno> está soportada en C, será devuelta vía C<$?> si la llamada a la función falla.

source: say $+ {b}; # *Also* prints '12'.
es_es: say $+ {b}; # *También* imprime '12'.

source: C<vmsish> upgraded to version 1.02
es_es: C<vmsish> actualizado a la versión 1.02

source: C<END> routines and destructors can change the exit status by modifying C<$?>.
es_es: Las rutinas C<END> y los destructores pueden cambiar el estado de salida modificando C<$?>.

source: Closes the currently selected filehandle if the argument is omitted.
es_es: Cierra el identificador de archivo actualmente seleccionado si se omite el argumento.

source: Returns the current position of the C<readdir> routines on DIRHANDLE.
es_es: Devuelve la posición actual de la rutina C<readdir> sobre IDENTIFICADOR_DIR.

source: See L<perlrecharclass/POSIX Character Classes> for details.
es_es: Vea L<perlrecharclass/Clases carácter POSIX> para más detalles.

# $flags = fcntl(REMOTE, F_GETFL, 0) or die "Can't get flags for the socket: $! ";
source: $flags = fcntl(REMOTE, F_GETFL, 0) or die "Can't get flags for the socket: $!\n";
es_es: $flags = fcntl(REMOTE, F_GETFL, 0) or die "No puedo obtener los flags para el socket: $!\n";

source: Unless the C</r> option is used, the string specified must be a scalar variable, an array element, a hash element, or an assignment to one of those; that is, some sort of scalar lvalue.
es_es: A menos que se use la opción C</r>, la cadena especificada debe ser una variable escalar, un elemento de un array, un elemento hash, o una asignación a una de estas; es decir, algún tipo de I<ivalor> escalar.

source: For example, this code has the same effect as the Unix touch(1) command when the files I<already exist> and belong to the user running the program:
es_es: Por ejemplo, este código tiene el mismo efecto que el comando touch(1) de Unix cuando los archivos <realmente existen> y pertenecen al usuario que ejecuta el programa:

source: Some case insensitive matches between UTF-8 encoded data and 8 bit regexps, and vice versa, could give malformed character warnings.
es_es: Algunas coincidencias insensibles al tamaño de caja de los caracteres, entre datos codificados en UTF-8 y expresiones regulares de 8 bits, y viceversa, podría dar advertencias sobre caracteres incorrectos.

source: to get the correct function definitions.
es_es: para obtener las correctas definiciones de la función.

source: # exactly the same
es_es: # exactamente lo mismo

source: It is always safe to use the two-argument form of C<open> if the filename argument is a known literal.
es_es: Siempre es más seguro utilizar el formato de dos argumentos de C<open> si el argumento con el nombre de archivo es un literal bien visible.

source: left , =>
es_es: izquierda , =>

source: Note also that zero-length look-ahead/look-behind assertions will not backtrack to make the tail match, since they are in "logical" context: only whether they match is considered relevant.
es_es: Tenga en cuenta también que las aserciones de longitud cero antecedentes/consecuentes no darán marcha atrás para retrasar la coincidencia, ya que ellas están en un contexto "lógico": sólo cuando coinciden son considerados relevantes.

source: The build procedure is completely standard:
es_es: El procedimiento de construcción es completamente estándar:

source: See L<perlsyn/"Switch statements"> for more details.
es_es: Consulte "Instrucciones switch" en L<perlsyn> para obtener información detallada.

source: The proper way to handle such calls is to assign C<$!=0> before the call, then check the value of C<$!> if C<syscall> returns C<-1>.
es_es: La forma correcta de manejar llamadas de ese tipo es el de asignar C<$!=0> antes de la llamada, y comprobar el valor de C<$!> si C<syscall> devuelve C<-1>.

source: B<WARNING>: One should not attempt to mix buffered I/O (like C<read> or <FH>) with C<select>, except as permitted by POSIX, and even then only on POSIX systems.
es_es: B<AVISO> : No debe tratar de mezclar el E/S con buferes (como C<read> o <FH>) con C<select>, excepto lo autorizado por POSIX, e incluso entonces sólo en sistemas POSIX.

source: If you're just looking for software, first use Google ( http://www.google.com ), Google's Usenet search interface ( http://groups.google.com ), and CPAN Search ( http://search.cpan.org ).
es_es: Si sólo busca software, empiece por Google ( http://www.google.com ), la interfaz de búsqueda de Usenet disponible en Google ( http://groups.google.com ) y CPAN Search ( http://search.cpan.org ).

source: See L<perlform> for other examples.
es_es: Ver L<perlform> para otros ejemplos.

source: z intepret integer as C type "size_t" on Perl 5.14 or later
es_es: z interpreta un entero como "size_t" del C en Perl 5.14 o superior

source: Query or change configuration of Perl modules that use Module::Build-based configuration files for features and config data.
es_es: Permite consultar o modificar la configuración de módulos Perl que usan archivos de configuración basados en Module::Build para características y datos de configuración.

source: =head2 Configuration improvements
es_es: =head2 Mejoras en la configuración

source: C<lcfirst> and C<ucfirst> could corrupt the string for certain cases where the length UTF-8 encoding of the string in lower case, upper case or title case differed.
es_es: C<lcfirst> y C<ucfirst> podrían corromper la cadena de caracteres en ciertos casos donde la longitud de la codificación UTF-8 de la cadena en minúsculas, mayúsculas o capitulares, puede diferir.

source: The metaconfig system has its own git repository.
es_es: El sistema metaconfig tiene su propio repositorio git.

source: The tests C<lib/Net/Ping/t/450_service.t> and C<lib/Net/Ping/t/510_ping_udp.t> fail.
es_es: Los test C<lib/Net/Ping/t/450_service.t> y C<lib/Net/Ping/t/510_ping_udp.t> fallan.

source: So the embedded C<#> is interpreted as a literal C<#>.
es_es: Así que el C<#> incrustado se interpreta como un C<#> literal.

source: If EXPR is omitted, changes to the directory specified by C<$ENV{HOME}>, if set; if not, changes to the directory specified by C<$ENV{LOGDIR}>.
es_es: Si se omite EXPR, cambia al directorio especificado por C<$ENV{HOME}>, si está puesto; si no, cambia al directorio especificado por C<$ENV{LOGDIR}>.

source: If EXPR is omitted, it stats C<$_> (not C<_>!).
es_es: Si EXPR se omite, se hace el stat de C<$_> (¡no de C<_>!).

source: The number 0, the strings C<'0'> and C<''>, the empty list C<()>, and C<undef> are all false in a boolean context.
es_es: El número 0, las cadenas C<'0'> y C<''>, la cadena vacía C<()> y C<undef> son todos falsos en contexto booleano.

source: Hardly what you had in mind unless you were aware of this feature of Perl 5.8.0.
es_es: Difícilmente se acordaría de ello a menos que fuera consciente de esta característica de Perl 5.8.0.

source: $#foo]; # slice last 5 items
es_es: $#foo]; # trocea los últimos 5 elementos

source: After configuration is done correctly give "make" to compile.
es_es: Después de la configuración haya terminado, se puede hacer un "make" para compilar.

source: use 5.006_001; # ditto; preferred for backwards compatibility
es_es: use 5.006_001; # ídem; preferido para mantener la compatibilidad
